Repository: xjtuyanshi/WeightCoach-Public
Catalog: WeightCoach/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 训练日 · 碳水稍高，总热量不变
en: Training Day · More carbs, same calories
zh_hant: 訓練日 · 碳水稍高，總熱量不變

source: 记录饮食后，这里会显示营养完成情况
en: Log food to see your nutrition progress here
zh_hant: 記錄飲食後，這裡會顯示營養完成情況

source: 部分记录缺少营养数据，宏量总计可能偏低
en: Some entries lack nutrient data, so macro totals may be understated
zh_hant: 部分記錄缺少營養資料，宏量總計可能偏低

source: 推荐方式
en: Recommendation Method
zh_hant: 建議方式

source: 宏量目标只是在现有热量预算内做分配，不会改变你的每日预算。
en: Macro goals only allocate your existing calorie budget; they do not change the daily budget.
zh_hant: 宏量目標只是在現有熱量預算內分配，不會改變每日預算。

source: 训练日燃料调整
en: Training-Day Fuel Adjustment
zh_hant: 訓練日燃料調整

source: 默认关闭。开启后，训练日只会在相同总热量内适当提高碳水、降低脂肪；蛋白质不变，也不代表减脂会更快。
en: Off by default. When enabled, training days shift some calories from fat to carbs while keeping protein and total calories unchanged. It does not mean faster fat loss.
zh_hant: 預設關閉。開啟後，訓練日只會在相同總熱量內適度提高碳水、降低脂肪；蛋白質不變，也不代表減脂會更快。

source: 当前提示
en: Current Note
zh_hant: 目前提示

source: 当前热量预算不足以同时满足常规蛋白质和脂肪比例，目标已在预算内收紧。若长期出现，请核对减重目标并咨询注册营养师。
en: The current calorie budget is too low to meet the usual protein and fat targets together, so goals were tightened within the budget. If this persists, review your weight-loss goal and consult a registered dietitian.
zh_hant: 目前熱量預算不足以同時滿足一般蛋白質與脂肪比例，目標已在預算內收緊。若長期出現，請檢查減重目標並諮詢註冊營養師。

source: 慢性肾病、医生限制蛋白质、妊娠哺乳或需要药物配合饮食时，请使用医生或注册营养师给出的目标。
en: If you have chronic kidney disease, a prescribed protein restriction, are pregnant or breastfeeding, or coordinate diet with medication, use goals from your doctor or registered dietitian.
zh_hant: 若有慢性腎病、醫師限制蛋白質、妊娠哺乳，或需配合藥物飲食，請使用醫師或註冊營養師提供的目標。

source: 热量消耗
en: Energy Expenditure
zh_hant: 熱量消耗

source: 热量消耗如何计算
en: How Energy Expenditure Is Calculated
zh_hant: 熱量消耗如何計算

source: 今日总消耗估算
en: Estimated Total Expenditure Today
zh_hant: 今日總消耗估算

source: 手表活动模式
en: Watch Activity Mode
zh_hant: 手錶活動模式

source: 活动系数模式
en: Activity-Factor Mode
zh_hant: 活動係數模式

source: 基础代谢
en: Basal Metabolism
zh_hant: 基礎代謝

source: Apple 健康活动
en: Apple Health Activity
zh_hant: Apple 健康活動

source: 健康活动（未计入）
en: Health Activity (Excluded)
zh_hant: 健康活動（未計入）

source: 手动运动补差
en: Manual Exercise Supplement
zh_hant: 手動運動補差

source: 手动运动（未计入）
en: Manual Exercise (Excluded)
zh_hant: 手動運動（未計入）

source: 目标缺口
en: Target Deficit
zh_hant: 目標缺口

source: 总消耗 = 基础代谢 × 1.1 + Apple 健康活动 + 未被健康记录的手动运动补差
en: Total expenditure = BMR × 1.1 + Apple Health activity + manual exercise not captured by Health
zh_hant: 總消耗 = 基礎代謝 × 1.1 + Apple 健康活動 + 未被健康記錄的手動運動補差

source: 总消耗 = 基础代谢 × 活动系数；Apple 健康与手动运动不重复叠加
en: Total expenditure = BMR × activity factor; Apple Health and manual exercise are not added again
zh_hant: 總消耗 = 基礎代謝 × 活動係數；Apple 健康與手動運動不重複疊加

source: 总消耗估算
en: Total Expenditure Estimate
zh_hant: 總消耗估算

source: 基础代谢 × 1.1
en: BMR × 1.1
zh_hant: 基礎代謝 × 1.1

source: 手动运动估算
en: Manual Exercise Estimate
zh_hant: 手動運動估算

source: 其中健康已记录
en: Already in Health
zh_hant: 其中健康已記錄

source: 活动系数
en: Activity Factor
zh_hant: 活動係數

source: 当前使用活动系数模式，手动补记只展示，不额外计入预算。
en: Activity-factor mode is active. Manual entries are shown but not added to the budget.
zh_hant: 目前使用活動係數模式，手動補記只顯示，不會額外計入預算。

source: 合计
en: Total
zh_hant: 合計

source: 这里继续使用既有的消耗模型；按运动时间扣除 Apple 健康已经记录的活动能量，只补缺失部分。
en: This keeps the existing expenditure model. Apple Health activity for the exercise period is deducted so only the missing portion is added.
zh_hant: 這裡繼續使用既有的消耗模型；依運動時間扣除 Apple 健康已記錄的活動能量，只補缺失部分。

source: 今日饮食目标
en: Today’s Food Goal
zh_hant: 今日飲食目標

source: 动态目标缺口
en: Dynamic Target Deficit
zh_hant: 動態目標缺口

source: 今日热量目标
en: Today’s Calorie Goal
zh_hant: 今日熱量目標

source: “还能吃”只用今日热量目标减去饮食摄入，不会再减一次运动消耗。
en: “Remaining” is today’s calorie goal minus food intake. Exercise isn’t subtracted a second time.
zh_hant: 「還能吃」只用今日熱量目標減去飲食攝取，不會再減一次運動消耗。

source: 热量消耗说明
en: About Energy Expenditure
zh_hant: 熱量消耗說明

source: 早餐
en: Breakfast

source: 午餐
en: Lunch

source: 晚餐
en: Dinner

source: 加餐
en: Snack
zh_hant: 點心

source: AI 识别
en: AI Scan
zh_hant: AI 辨識

source: 快捷再记
en: Quick Repeat
zh_hant: 快速再記

source: 食物参考库
en: Food Reference
zh_hant: 食物參考庫

source: 品牌配方估算
en: Branded Recipe Estimate

source: 营养标签
en: Nutrition Label
zh_hant: 營養標示

source: 手动创建
en: Manual
zh_hant: 手動建立

source: 演示数据
en: Demo Data
zh_hant: 示範資料

source: 毫升
en: mL

source: 包
en: package

source: 减少
en: Decrease
zh_hant: 減少

source: 增加
en: Increase

source: 篮球
en: Basketball
zh_hant: 籃球

source: 跑步
en: Running

source: 投篮练习
en: Shooting Practice
zh_hant: 投籃練習

source: 一般强度
en: General Intensity
zh_hant: 一般強度

source: 比赛强度
en: Game Intensity
zh_hant: 比賽強度

source: 慢跑
en: Slow Run

source: 中速跑
en: Moderate Run

source: 快速跑
en: Fast Run

source: 投篮、罚球等练习
en: Shooting, free throws, and similar practice
zh_hant: 投籃、罰球等練習

source: 一般球局，包含走动和短暂停顿
en: Casual play with movement and short pauses
zh_hant: 一般球局，包含走動與短暫停頓

source: 持续对抗或全场比赛
en: Continuous competitive or full-court play
zh_hant: 持續對抗或全場比賽

source: 约 4.0–4.2 mph（约 13 分/英里）
en: About 4.0–4.2 mph (about 13 min/mile)
zh_hant: 約 4.0–4.2 mph（約 13 分/英里）

source: 约 5.0–5.2 mph（约 12 分/英里）
en: About 5.0–5.2 mph (about 12 min/mile)
zh_hant: 約 5.0–5.2 mph（約 12 分/英里）

source: 约 7.0 mph（约 8.5 分/英里）
en: About 7.0 mph (about 8.5 min/mile)
zh_hant: 約 7.0 mph（約 8.5 分/英里）

source: 饱和脂肪
en: Saturated Fat
zh_hant: 飽和脂肪

source: 反式脂肪
en: Trans Fat

source: 胆固醇
en: Cholesterol
zh_hant: 膽固醇

source: 膳食纤维
en: Dietary Fiber
zh_hant: 膳食纖維

source: 总糖
en: Total Sugars
zh_hant: 總糖

source: 添加糖
en: Added Sugars

source: 钠
en: Sodium
zh_hant: 鈉

source: 维生素 D
en: Vitamin D
zh_hant: 維生素 D

source: 钙
en: Calcium
zh_hant: 鈣

source: 铁
en: Iron
zh_hant: 鐵

source: 钾
en: Potassium
zh_hant: 鉀

source: 主要营养
en: Main Nutrients
zh_hant: 主要營養素

source: 今天
en: Today

source: 休息日
en: Rest Day

source: 训练日
en: Training Day
zh_hant: 訓練日

source: 还差
en: Remaining
zh_hant: 還差

source: 按已记录还差
en: Remaining from known entries
zh_hant: 依已記錄還差

source: 已达标
en: Goal Met
zh_hant: 已達標

source: 高于目标
en: Above Goal
zh_hant: 高於目標

source: 暂无已记录数据
en: No recorded data
zh_hant: 暫無已記錄資料

source: 目标
en: goal
zh_hant: 目標

source: 已记录
en: recorded
zh_hant: 已記錄

source: 实际
en: Actual
zh_hant: 實際

source: 系列
en: Series

source: 目标轨迹
en: Goal Path
zh_hant: 目標軌跡

source: 范围
en: Range
zh_hant: 範圍

source: 千卡/天
en: kcal/day
zh_hant: 大卡/天

source: 没有合适结果？自行填写
en: No suitable result? Enter manually
zh_hant: 沒有合適結果？自行填寫

source: 的联想
en: suggestions
zh_hant: 的聯想

source: 每100克
en: Per 100 g

source: 总脂肪
en: Total Fat
zh_hant: 總脂肪

source: 约
en: Approx.
zh_hant: 約

source: 精确值未提供
en: Exact value not provided
zh_hant: 未提供精確值

source: 范围下限不能大于上限。
en: The range minimum can’t exceed the maximum.
zh_hant: 範圍下限不能大於上限。

source: 精确值必须落在填写的范围内。
en: The exact value must fall within the entered range.
zh_hant: 精確值必須落在填寫的範圍內。

source: 日均参考必须是大于 0 且小于 10,000 的有效千卡数。
en: The daily reference must be a valid calorie value greater than 0 and less than 10,000.
zh_hant: 日均參考必須是大於 0 且小於 10,000 的有效大卡數。

source: 数据库中没有找到该商品，可以改用手动输入（参考包装上的营养标签）
en: This product wasn’t found in the database. Enter it manually using the package nutrition label.
zh_hant: 資料庫中找不到此商品，可改用手動輸入（參考包裝上的營養標示）。

source: 找到了商品，但数据库没有可靠热量数据。请扫描包装上的营养表
en: The product was found, but the database has no reliable calorie data. Scan the package nutrition label.
zh_hant: 已找到商品，但資料庫沒有可靠的熱量資料。請掃描包裝上的營養標示。

source: 照片数据为空，请重新拍摄
en: The photo is empty. Take it again.
zh_hant: 照片資料為空，請重新拍攝。

source: 无法读取这张营养表照片
en: Couldn’t read this nutrition-label photo
zh_hant: 無法讀取這張營養標示照片

source: 本机文字识别失败
en: On-device text recognition failed
zh_hant: 本機文字辨識失敗

source: 没有识别到营养表文字，请靠近并保持镜头平行后重拍
en: No nutrition-label text was found. Move closer, keep the camera parallel, and retake the photo.
zh_hant: 沒有辨識到營養標示文字，請靠近並保持鏡頭平行後重拍。

source: 饮食已保存在 App，但当前无法写入 Apple 健康。
en: The food entry is saved in the app, but it can’t currently be written to Apple Health.
zh_hant: 飲食已儲存在 App，但目前無法寫入 Apple 健康。

source: 同步状态未能保存，请稍后重试。
en: The sync status couldn’t be saved. Please try again later.
zh_hant: 同步狀態無法儲存，請稍後再試。

source: 已撤销
en: Undone
zh_hant: 已復原

source: 确认记录
en: Log Entry
zh_hant: 確認記錄

source: 分钟
en: min
zh_hant: 分鐘

source: 活动时长
en: Active Duration
zh_hant: 活動時長

source: 按
en: at
zh_hant: 依

source: 蛋白
en: Protein
zh_hant: 蛋白質

source: 包装每份约
en: About
zh_hant: 包裝每份約

source: 包装每份
en: Package serving
zh_hant: 包裝每份

source: 每包约
en: About
zh_hant: 每包約

source: 标准配方原有
en: Standard recipe
zh_hant: 標準配方原有

source: 最终总量
en: Final total
zh_hant: 最終總量

source: 泵
en: pumps

source: 估算区间
en: Estimated range
zh_hant: 估算區間

source: 合理区间
en: Reasonable range
zh_hant: 合理區間

source: 估算
en: Estimated

source: 宏量数据覆盖
en: Macro data coverage
zh_hant: 宏量資料覆蓋

source: 按已记录热量
en: by logged calories
zh_hant: 依已記錄熱量

source: 暂无数据
en: No data
zh_hant: 暫無資料

source: 保存常用商品失败
en: Couldn’t Save Favorite Product
zh_hant: 儲存常用商品失敗

source: 保存商品失败
en: Couldn’t Save Product
zh_hant: 儲存商品失敗

source: 设置
en: Settings
zh_hant: 設定

source: 个人资料
en: Profile
zh_hant: 個人資料

source: 性别
en: Sex
zh_hant: 性別

source: 从 Apple 健康同步身高/年龄/性别
en: Sync Height, Age & Sex from Apple Health
zh_hant: 從 Apple 健康同步身高／年齡／性別

source: Apple 健康有数据时优先使用健康数据；这里的值仅作兜底。
en: Apple Health data takes priority when available. These values are only fallbacks.
zh_hant: Apple 健康有資料時會優先使用；這裡的值僅作備援。

source: 身体成分
en: Body Composition
zh_hant: 身體組成

source: 严格区分完整去脂体重、DEXA 瘦软组织、四肢瘦体重、Fitdays 肌肉量、骨骼肌和 SMI。
en: Keeps total fat-free mass, DEXA lean soft tissue, appendicular lean mass, Fitdays muscle mass, skeletal muscle, and SMI distinct.
zh_hant: 嚴格區分完整去脂體重、DEXA 瘦軟組織、四肢瘦體重、Fitdays 肌肉量、骨骼肌和 SMI。

source: 起始体重
en: Starting Weight
zh_hant: 起始體重

source: 开始日期
en: Start Date
zh_hant: 開始日期

source: 计入 Apple 健康活动能量
en: Include Apple Health Active Energy
zh_hant: 計入 Apple 健康活動能量

source: 基础活动水平
en: Baseline Activity Level
zh_hant: 基礎活動水平

source: 久坐（几乎不运动）
en: Sedentary (little exercise)
zh_hant: 久坐（幾乎不運動）

source: 轻度活动（每周运动 1-3 次）
en: Lightly Active (1–3 times/week)
zh_hant: 輕度活動（每週運動 1–3 次）

source: 中度活动（每周运动 3-5 次）
en: Moderately Active (3–5 times/week)
zh_hant: 中度活動（每週運動 3–5 次）

source: 消耗计算
en: Expenditure Calculation
zh_hant: 消耗計算

source: 当前模式：总消耗 = 基础代谢 × 1.1（食物热效应）+ 手表实测的全天活动能量。活动系数不参与计算，避免把日常活动算两遍。当天预算会随活动量实时增长。
en: Current mode: total expenditure = BMR × 1.1 (thermic effect of food) + all-day active energy measured by your watch. The activity factor is excluded to avoid double counting daily activity. Today’s budget grows with activity.
zh_hant: 目前模式：總消耗 = 基礎代謝 × 1.1（食物熱效應）+ 手錶實測的全天活動能量。活動係數不參與計算，避免把日常活動算兩次。當天預算會隨活動量即時增加。

source: 当前模式：总消耗 = 基础代谢 × 活动系数（粗略估算）。有 Apple Watch 时建议打开上方开关，用实测值更准。
en: Current mode: total expenditure = BMR × activity factor (rough estimate). If you use Apple Watch, enable the switch above for measured activity.
zh_hant: 目前模式：總消耗 = 基礎代謝 × 活動係數（粗略估算）。有 Apple Watch 時建議開啟上方開關，使用實測值更準。

source: 营养目标
en: Nutrition Goals
zh_hant: 營養目標

source: 训练日会在同样的热量预算内适当提高碳水、降低脂肪；蛋白质和每日总热量不变。这只是燃料安排，不代表减脂会更快。
en: Training days shift some calories from fat to carbs while keeping protein and total calories unchanged. This is fuel timing, not faster fat loss.
zh_hant: 訓練日會在相同熱量預算內適度提高碳水、降低脂肪；蛋白質與每日總熱量不變。這只是燃料安排，不代表減脂會更快。

source: 默认使用稳定的保肌营养目标。需要时可开启训练日燃料调整；不会自动猜测训练日。
en: Uses stable muscle-retention nutrition goals by default. Enable training-day fuel adjustments when needed; the app won’t guess training days.
zh_hant: 預設使用穩定的保肌營養目標。需要時可開啟訓練日燃料調整；不會自動猜測訓練日。

source: 20:30 饮食记录提醒
en: 8:30 PM Food Log Reminder
zh_hant: 20:30 飲食記錄提醒

source: 8:00 称重提醒
en: 8:00 AM Weigh-In Reminder
zh_hant: 8:00 量體重提醒

source: 每日提醒
en: Daily Reminders

source: 只有当天还没有对应记录时才会提醒。首次开启会申请系统通知权限。
en: A reminder is sent only if the matching entry is still missing that day. Enabling it for the first time requests notification permission.
zh_hant: 只有當天還沒有對應記錄時才會提醒。首次開啟會申請系統通知權限。

source: AI 拍照识别
en: AI Photo Recognition
zh_hant: AI 拍照辨識

source: 识别方式
en: Recognition Method
zh_hant: 辨識方式

source: Mac mini + ChatGPT 订阅
en: Mac mini + ChatGPT Subscription
zh_hant: Mac mini + ChatGPT 訂閱

source: https://你的私有桥接地址
en: https://your-private-bridge-address
zh_hant: https://你的私人橋接位址

source: 请输入完整的 HTTPS 地址；地址不能包含用户名、密码、查询参数或片段。
en: Enter a complete HTTPS address. The address must not include a username, password, query parameters, or a fragment.
zh_hant: 請輸入完整的 HTTPS 位址；位址不得包含使用者名稱、密碼、查詢參數或片段。

source: 私有 AI 识别桥接 HTTPS 地址
en: Private AI Recognition Bridge HTTPS Address
zh_hant: 私人 AI 辨識橋接 HTTPS 位址

source: 保存并检测
en: Save & Test
zh_hant: 儲存並檢測

source: 清除并禁用
en: Clear & Disable
zh_hant: 清除並停用

source: 尚未配置；照片不会上传，手动记录仍可使用
en: Not configured. Photos won’t be uploaded; manual logging still works.
zh_hant: 尚未設定；照片不會上傳，手動記錄仍可使用

source: 正在检查 Mac mini…
en: Checking Mac mini…
zh_hant: 正在檢查 Mac mini…

source: 识别服务在线
en: Recognition Service Online
zh_hant: 辨識服務在線

source: 识别模型
en: Recognition Model
zh_hant: 辨識模型

source: Mac mini 暂时离线
en: Mac mini Temporarily Offline
zh_hant: Mac mini 暫時離線

source: 重新检测
en: Test Again
zh_hant: 重新檢測

source: 每位使用者必须填写自己的 HTTPS 私有桥接地址。这里仅保存 URL，绝不能填写 API Key、密码或访问令牌。未配置时照片不会上传；临时照片在请求后删除，结果和份量仍需确认。
en: Each user must enter their own private HTTPS bridge address. Only the URL is stored here—never enter an API key, password, or access token. Without configuration, photos aren’t uploaded. Temporary photos are deleted after each request, and results and portions still require confirmation.
zh_hant: 每位使用者都必須填寫自己的 HTTPS 私人橋接位址。這裡只儲存 URL，絕不能填入 API Key、密碼或存取權杖。未設定時照片不會上傳；暫存照片會在請求後刪除，結果與份量仍需確認。

source: 地址已保存在本机；正在检测连接。
en: Address saved on this device. Testing the connection.
zh_hant: 位址已儲存在本機；正在檢測連線。

source: 已清除并禁用 AI 桥接；照片不会上传。
en: AI bridge cleared and disabled. Photos won’t be uploaded.
zh_hant: 已清除並停用 AI 橋接；照片不會上傳。

source: Apple 健康
en: Apple Health

source: 可用
en: Available

source: 不可用
en: Unavailable

source: 最近体重
en: Latest Weight
zh_hant: 最近體重

source: 未读取到
en: Not Read
zh_hant: 未讀取到

source: 今日活动能量
en: Active Energy Today
zh_hant: 今日活動能量

source: 请求健康数据授权
en: Request Health Data Access
zh_hant: 請求健康資料授權

source: 关于
en: About
zh_hant: 關於

source: 本 App 的热量估算仅供参考，不构成医疗建议。如有健康问题请咨询医生或注册营养师。
en: Calorie estimates are for reference only and are not medical advice. Consult a doctor or registered dietitian for health concerns.
zh_hant: 本 App 的熱量估算僅供參考，不構成醫療建議。如有健康問題，請諮詢醫師或註冊營養師。

source: 通知权限未开启
en: Notifications Are Off
zh_hant: 通知權限未開啟

source: 前往系统设置
en: Open Settings
zh_hant: 前往系統設定

source: 请在系统设置中允许「减重助手」发送通知后，再开启每日提醒。
en: Allow WeightCoach notifications in Settings, then enable daily reminders.
zh_hant: 請在系統設定中允許「減重助手」傳送通知後，再開啟每日提醒。

source: 今日
en: Today

source: 快捷记录失败
en: Quick Log Failed
zh_hant: 快速記錄失敗

source: 扫条形码
en: Scan Barcode
zh_hant: 掃描條碼

source: 本周能量账本
en: Weekly Energy Ledger
zh_hant: 本週能量帳本

source: 估算缺口
en: Estimated Deficit

source: 估算盈余
en: Estimated Surplus
zh_hant: 估算盈餘

source: 趋势读取失败，点此重试
en: Couldn’t Load Trends. Tap to Retry.
zh_hant: 趨勢讀取失敗，點此重試

source: 数据不足，暂不能计算
en: Not Enough Data to Calculate
zh_hant: 資料不足，暫時無法計算

source: 能量差
en: Energy Balance

source: 正数为缺口，负数为盈余；只统计已记录且数据可用的日期。
en: Positive values are deficits and negative values are surpluses. Only days with recorded, usable data are included.
zh_hant: 正數為缺口，負數為盈餘；只統計已記錄且資料可用的日期。

source: 打开近 7 天和近 30 天详细趋势
en: Open detailed 7-day and 30-day trends
zh_hant: 開啟近 7 天與近 30 天詳細趨勢

source: 最近吃过 · 点一下直接记
en: Recently Eaten · Tap to Log
zh_hant: 最近吃過 · 點一下直接記

source: 常吃与最近 · 点一下直接记
en: Frequent & Recent · Tap to Log
zh_hant: 常吃與最近 · 點一下直接記

source: 常吃
en: Frequent

source: 最近
en: Recent

source: 按上次份量
en: Use Last Portion
zh_hant: 依上次份量

source: 按上次记录
en: Use Last Entry
zh_hant: 依上次記錄

source: 🎉 已达成目标！继续保持
en: 🎉 Goal Reached! Keep It Up
zh_hant: 🎉 已達成目標！繼續保持

source: 连接 Apple 健康
en: Connect Apple Health
zh_hant: 連接 Apple 健康

source: 尚未读取到体重数据。请确认已授权本 App 读取健康数据（设置 → 健康 → 数据访问与设备），或在「体重」页手动记录一次。
en: No weight data was found. Confirm that Health access is allowed (Settings → Health → Data Access & Devices), or log a weight manually on the Weight tab.
zh_hant: 尚未讀取到體重資料。請確認已允許本 App 讀取健康資料（設定 → 健康 → 資料存取與裝置），或在「體重」頁手動記錄一次。

source: 当前设备不支持 HealthKit，将使用手动记录的数据。
en: HealthKit isn’t supported on this device. Manually logged data will be used.
zh_hant: 目前裝置不支援 HealthKit，將使用手動記錄的資料。

source: 重新请求授权
en: Request Access Again
zh_hant: 重新請求授權

source: 近 7 天
en: Last 7 Days

source: 近 30 天
en: Last 30 Days

source: 能量
en: Energy

source: 时间范围
en: Time Range
zh_hant: 時間範圍

source: 趋势指标
en: Trend Metric
zh_hant: 趨勢指標

source: 正在读取历史数据…
en: Loading History…
zh_hant: 正在讀取歷史資料…

source: 趋势暂时不可用
en: Trends Temporarily Unavailable
zh_hant: 趨勢暫時無法使用

source: 饮食与能量趋势
en: Food & Energy Trends
zh_hant: 飲食與能量趨勢

source: 截至昨天
en: Through Yesterday

source: 本周还没有已结束的日期
en: No Completed Days This Week Yet
zh_hant: 本週還沒有已結束的日期

source: 数据不足，暂不能计算本周能量差
en: Not Enough Data to Calculate This Week’s Energy Balance
zh_hant: 資料不足，暫時無法計算本週能量差

source: 正数为缺口，负数为盈余；周末多吃会抵消之前的缺口。
en: Positive values are deficits and negative values are surpluses. Weekend overeating offsets earlier deficits.
zh_hant: 正數為缺口，負數為盈餘；週末多吃會抵消之前的缺口。

source: 每日摄入与估算消耗
en: Daily Intake & Estimated Expenditure
zh_hant: 每日攝取與估算消耗

source: 已记录摄入
en: Logged Intake
zh_hant: 已記錄攝取

source: 估算消耗
en: Estimated Expenditure

source: 平衡
en: Balance

source: 缺口
en: Deficit

source: 盈余
en: Surplus
zh_hant: 盈餘

source: 每日估算能量差
en: Daily Estimated Energy Balance

source: 今天尚未结束，不进入能量差与本周累计。
en: Today is still in progress and is excluded from energy balance and weekly totals.
zh_hant: 今天尚未結束，不會納入能量差與本週累計。

source: 数据覆盖
en: Data Coverage
zh_hant: 資料覆蓋

source: 柱子越浅，代表当天宏量营养数据越不完整；未知值不会按 0 计算。
en: Lighter bars mean less complete macro data for that day. Unknown values are not treated as zero.
zh_hant: 柱子越淺，表示當天宏量營養資料越不完整；未知值不會以 0 計算。

source: 结果会随 Apple 健康延迟同步而更新，只代表已记录数据，不是精密代谢测量。
en: Results update as delayed Apple Health data syncs. They reflect logged data, not precise metabolic measurement.
zh_hant: 結果會隨 Apple 健康延遲同步而更新，只代表已記錄資料，不是精密代謝測量。

source: 营养数据完整度未知
en: Nutrition data completeness unknown
zh_hant: 營養資料完整度未知

source: 校准体脂
en: Calibrated Body Fat
zh_hant: 校準體脂

source: 趋势
en: Trend
zh_hant: 趨勢

# language.en
source: 英语
en: English
zh_hant: 英文

# language.footer
source: App 内文字会立即切换。相机、健康等系统权限说明遵循 iPhone 的系统或每 App 语言设置。
en: App text changes immediately. Camera, Health, and other system permission messages follow the iPhone system or per-app language setting.
zh_hant: App 內文字會立即切換。相機、健康等系統權限說明會依照 iPhone 的系統或個別 App 語言設定。

# language.picker
source: App 语言
en: App Language
zh_hant: App 語言

# language.section
source: 语言
en: Language
zh_hant: 語言

# language.system
source: 跟随系统
en: Follow System
zh_hant: 跟隨系統

# language.zh-Hans
source: 简体中文
en: Simplified Chinese
zh_hant: 簡體中文

# language.zh-Hant
source: 繁体中文
en: Traditional Chinese
zh_hant: 繁體中文

# notification.food.body
source: 今天还没记录饮食
en: You haven't logged any food today
zh_hant: 今天還沒記錄飲食

# notification.title
source: 减重助手
en: WeightCoach
zh_hant: 減重助手

# notification.weight.body
source: 早上好，记得称重
en: Good morning — remember to weigh in
zh_hant: 早安，記得量體重

# food.health.delete.failed
source: Apple 健康中的对应记录未能删除，本地饮食记录已保留。
en: The matching Apple Health record could not be deleted. The local food entry was kept.
zh_hant: Apple 健康中的對應記錄無法刪除，本機飲食記錄已保留。

# food.health.sync.cleanup.failed
source: 旧的 Apple 健康样本尚未清理；为避免重复记录，已停止重试。
en: The previous Apple Health sample could not be cleaned up, so retry stopped to prevent duplicates.
zh_hant: 舊的 Apple 健康樣本尚未清除；為避免重複記錄，已停止重試。

# food.health.sync.entryDeleted
source: 本地饮食记录已经删除，未继续写入 Apple 健康。
en: The local food entry was already deleted, so nothing new was written to Apple Health.
zh_hant: 本機飲食記錄已刪除，因此未繼續寫入 Apple 健康。

# food.health.sync.local.failed
source: Apple 健康同步状态未能保存，请稍后重试。
en: The Apple Health sync status could not be saved. Please try again.
zh_hant: Apple 健康同步狀態無法儲存，請稍後再試。

# food.health.sync.unavailable
source: 饮食已保存在 App，但当前无法写入 Apple 健康。
en: The food entry was saved in the app, but Apple Health is currently unavailable.
zh_hant: 飲食已儲存在 App，但目前無法寫入 Apple 健康。

# food.health.sync.write.failed
source: 饮食仍保存在 App，但 Apple 健康同步失败。
en: The food entry remains saved in the app, but Apple Health sync failed.
zh_hant: 飲食仍保存在 App，但 Apple 健康同步失敗。

# food.local.delete.failed
source: 本地饮食记录未能删除，请稍后重试。
en: The local food entry could not be deleted. Please try again.
zh_hant: 本機飲食記錄無法刪除，請稍後再試。

# food.local.delete.remoteDeleted
source: Apple 健康记录已删除，但本地记录暂时未能移除。请稍后重试；再次操作只会做幂等清理。
en: The Apple Health record was deleted, but the local entry could not be removed. Please retry; cleanup is idempotent.
zh_hant: Apple 健康記錄已刪除，但本機記錄暫時無法移除。請稍後再試；再次操作只會進行冪等清理。

source: 最近刷新失败，当前周数据可能已过期；点开趋势页可重试。
en: The latest refresh failed, so this week's data may be outdated. Open Trends to retry.
zh_hant: 最近重新整理失敗，本週資料可能已過期；開啟趨勢頁即可重試。

source: 部分日期使用了有日期依据的校准体脂估算基础代谢。
en: Some days estimate BMR using a calibrated body-fat value with a recorded date.
zh_hant: 部分日期使用有日期依據的校準體脂估算基礎代謝。

source: 部分日期缺少历史体重，已使用档案起始体重估算。
en: Historical weight was missing for some days, so the profile start weight was used as an estimate.
zh_hant: 部分日期缺少歷史體重，因此使用檔案起始體重估算。

source: 照片会保留在本页供你核对；未明确识别为餐盘时不会随记录保存
en: The photo stays on this screen for review and is not saved with the entry unless it is clearly identified as a food photo.
zh_hant: 照片會保留在本頁供你核對；未明確辨識為餐盤時不會隨記錄儲存

# tab.exercise
source: 运动
en: Exercise
zh_hant: 運動

# tab.food
source: 饮食
en: Food
zh_hant: 飲食

# tab.settings
source: 设置
en: Settings
zh_hant: 設定

# tab.today
source: 今日
en: Today

# tab.weight
source: 体重
en: Weight
zh_hant: 體重

# common_food.unit.grams
source: 克
en: g
zh_hant: 公克

# common_food.per_100_grams
source: 每100克
en: Per 100 g
zh_hant: 每100公克

# common_food.broccoli-raw.name
source: 西兰花
en: Broccoli
zh_hant: 青花菜

# common_food.broccoli-raw.preparation
source: 生，可食部分
en: Raw, edible portion
zh_hant: 生鮮，可食部分

# common_food.shrimp-cooked.name
source: 虾仁
en: Shrimp
zh_hant: 蝦仁

# common_food.shrimp-cooked.preparation
source: 熟、去壳，不含额外用油
en: Cooked and peeled; no added oil
zh_hant: 熟、去殼，不含額外用油

# common_food.chicken-breast-cooked.name
source: 鸡胸肉
en: Chicken Breast
zh_hant: 雞胸肉

# common_food.chicken-breast-cooked.preparation
source: 烤熟、去皮、仅肉，不含额外用油
en: Roasted, skinless meat only; no added oil
zh_hant: 烤熟、去皮、僅取肉，不含額外用油

# common_food.white-rice-cooked.name
source: 白米饭
en: White Rice
zh_hant: 白飯

# common_food.white-rice-cooked.preparation
source: 长粒白米、熟、无盐，不含额外用油
en: Cooked long-grain white rice, unsalted; no added oil
zh_hant: 長粒白米、煮熟、無鹽，不含額外用油

# common_food.salmon-cooked.name
source: 大西洋三文鱼
en: Atlantic Salmon
zh_hant: 大西洋鮭魚

# common_food.salmon-cooked.preparation
source: 养殖、干热熟制，不含额外用油
en: Farmed, dry-heat cooked; no added oil
zh_hant: 養殖、乾熱烹調，不含額外用油

# common_food.egg-hard-boiled.name
source: 水煮蛋
en: Hard-Boiled Egg

# common_food.egg-hard-boiled.preparation
source: 全蛋、煮熟，不含额外用油
en: Whole egg, boiled; no added oil
zh_hant: 全蛋、水煮熟，不含額外用油

# common_food.spinach-raw.name
source: 菠菜
en: Spinach

# common_food.spinach-raw.preparation
source: 生，可食部分
en: Raw, edible portion
zh_hant: 生鮮，可食部分

# common_food.banana-raw.name
source: 香蕉
en: Banana

# common_food.banana-raw.preparation
source: 生、去皮
en: Raw and peeled
zh_hant: 生鮮、去皮

# common_food.avocado-raw.name
source: 牛油果
en: Avocado
zh_hant: 酪梨

# common_food.avocado-raw.preparation
source: 生，可食部分
en: Raw, edible portion
zh_hant: 生鮮，可食部分

# common_food.apple-raw.name
source: 苹果
en: Apple
zh_hant: 蘋果

# common_food.apple-raw.preparation
source: 生、带皮
en: Raw with skin
zh_hant: 生鮮、帶皮

# common_food.carrot-raw.name
source: 胡萝卜
en: Carrot
zh_hant: 胡蘿蔔

# common_food.carrot-raw.preparation
source: 生，可食部分
en: Raw, edible portion
zh_hant: 生鮮，可食部分

# common_food.tofu-firm.name
source: 硬豆腐
en: Firm Tofu
zh_hant: 板豆腐

# common_food.tofu-firm.preparation
source: 硫酸钙凝固、未煎炸
en: Set with calcium sulfate; not fried
zh_hant: 硫酸鈣凝固、未煎炸

# common_food.greek-yogurt-nonfat.name
source: 无脂原味希腊酸奶
en: Plain Nonfat Greek Yogurt
zh_hant: 無脂原味希臘優格
